-- phpMyAdmin SQL Dump
-- version 5.1.3
-- https://www.phpmyadmin.net/
--
-- 主機： 127.0.0.1
-- 產生時間： 2022-06-08 18:31:35
-- 伺服器版本： 10.4.25-MariaDB
-- PHP 版本： 7.4.29

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 資料庫: `fteam`
--

-- --------------------------------------------------------

--
-- 資料表結構 `lesson`
--

CREATE TABLE `lesson` (
  `sid` int(11) NOT NULL,
  `name` varchar(255) NOT NULL,
  `info` varchar(255) NOT NULL,
  `categories_id` int(11) DEFAULT NULL,
  `duringtime_begin` date NOT NULL,
  `duringtime_end` date NOT NULL,
  `number_of_people` int(255) NOT NULL,
  `price` int(255) NOT NULL,
  `teacher` varchar(255) NOT NULL,
  `location` varchar(255) NOT NULL,
  `created_at` datetime DEFAULT NULL,
  `updated_at` datetime DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- 傾印資料表的資料 `lesson`
--

INSERT INTO `lesson` (`sid`, `name`, `info`, `categories_id`, `duringtime_begin`, `duringtime_end`, `number_of_people`, `price`, `teacher`, `location`, `created_at`, `updated_at`) VALUES
(1, '((G) I-DLE) My Bag (MVdance)', '俗話說的好，掌握思考過程，也就掌握了街舞。我認為，我想，把街舞的意義想清楚，對各位來說並不是一件壞事。這必定是個前衛大膽的想法。\r\n\r\n', 0, '2022-06-05', '2022-07-05', 8, 3000, '小ㄗ', '台北市信義區', '2022-06-01 08:40:20', '2022-06-08 15:55:04'),
(2, '流行熱門舞蹈課程(單堂無進度)', ' 總結來說，跳舞可以說是有著成為常識的趨勢。諸葛亮曾經提到過，少壯不努力，老大徒傷悲。才須學也，非學無以廣才，非志無以成學。這句話幾乎解讀出了問題的根本。', 0, '2022-07-31', '2022-08-31', 5, 2250, '小雞', '台北市北投區', '2022-06-01 09:48:46', NULL),
(3, 'New Jazz 基礎爵士(單堂無進度)', '土光敏夫曾經說過，風險和利益的大小是成正比的。但願各位能從這段話中獲得心靈上的滋長。透過逆向歸納，得以用最佳的策略去分析跳舞。', 0, '2022-06-16', '2022-07-16', 6, 2500, '圈圈', '台北市大安區', '2022-06-01 09:52:50', NULL),
(4, 'Jessi - Zoom (MVdance)', ' 帶著這些問題，我們一起來審視跳舞。一般來說，我們不得不相信，奧弗伯里說過一句富有哲理的話，一個除了榮耀的祖先而一無所有的人，就像一個土豆唯一適合他的地方就泥地下面。這把視野帶到了全新的高度。', 0, '2022-06-10', '2022-07-10', 6, 3000, '小佑', '台北市松山區', '2022-06-01 09:55:51', '2022-06-08 11:36:01'),
(5, 'GIDLE - TOMBOY (MVdance)', ' 跳舞對我來說有著舉足輕重的地位，必須要嚴肅認真的看待。我們都有個共識，若問題很困難，那就勢必不好解決。了解清楚跳舞到底是一種怎麼樣的存在，是解決一切問題的關鍵。', 1, '2022-07-14', '2022-08-14', 5, 3000, '大壯', '台北市中正區', '2022-06-01 09:58:41', NULL),
(6, '基礎嘻哈爵士 Jazz HIPHOP (單堂無進度)', '  街舞絕對是史無前例的。生活中，若街舞出現了，我們就不得不考慮它出現了的事實。謹慎地來說，我們必須考慮到所有可能。', 1, '2022-07-24', '2022-08-24', 5, 2250, '小ㄗ', '台北市信義區', '2022-06-01 10:06:46', NULL),
(7, '新手Jazz爵士入門(適合真正零基礎)', '        所謂街舞，關鍵是街舞需要如何解讀。諸葛亮講過，士之相知，溫不增華，寒不改葉，能四時而不衰，歷夷險而益固。這段話的餘韻不斷在我腦海中迴盪著。\r\n\r\n', 1, '2022-07-01', '2022-08-01', 5, 2250, '小雞', '台北市北投區', '2022-06-01 10:10:14', NULL),
(8, 'POPPING街舞', '        街舞勢必能夠左右未來。動機，可以說是最單純的力量。生活中，若街舞出現了，我們就不得不考慮它出現了的事實。我們要學會站在別人的角度思考。\r\n\r\n', 1, '2022-06-28', '2022-07-28', 7, 2500, '圈圈', '台北市大安區', '2022-06-01 10:18:02', '2022-06-08 22:18:44'),
(9, 'Breaking街舞體驗', '儘管街舞看似不顯眼，卻佔據了我的腦海。蒙田曾說過一句意義深遠的話，各市有各市的風俗，各鄉有各鄉的。這段話非常有意思。\r\n\r\n', 0, '2022-07-09', '2022-08-09', 6, 3000, '小佑', '台北市松山區', '2022-06-01 10:28:35', NULL),
(10, 'LA STYLE - TBC舞蹈', '        白哲特在不經意間這樣說過，堅強的信念能贏得強者的心，並使他們變得更堅強。。這不禁令我重新仔細的思考。白哲特說過一句很有意思的話，堅強的信念能贏得強者的心，並使他們變得更堅強。這段話讓我的心境提高了一個層次。街舞的出現，重寫了人生的意義。\r\n\r\n', 1, '2022-06-19', '2022-07-19', 8, 3000, '大壯', '台北市中正區', '2022-06-01 10:32:15', NULL),
(11, '454', '6456', 0, '2022-07-24', '2022-08-14', 5, 3000, '564', '45645', '2022-06-02 19:39:22', NULL),
(39, 'Mysql&PHP', '聽不懂背就對了', NULL, '2022-03-27', '2022-08-24', 44, 3000, '林心得', '204教室', '2022-06-05 23:20:35', '2022-06-08 11:01:54'),
(40, 'Mysql&PHP', '聽不懂背就對了', NULL, '2022-03-27', '2022-08-24', 44, 3000, '林心得', '204教室', '2022-06-05 23:21:47', NULL),
(42, '324', '43242', NULL, '2022-06-17', '2022-07-01', 342, 4234, '4234', '4234', '2022-06-06 14:06:31', NULL),
(44, '122314', '跑跑跑\r\n', NULL, '2022-06-14', '2022-06-30', 24324, 3000, '4234', 'fdsf', '2022-06-06 18:27:52', '2022-06-08 22:06:27'),
(46, '第一個', 'dsadas', NULL, '2022-06-15', '2022-06-24', 11, 1, 'sad', 'sdads', '2022-06-07 13:39:44', '2022-06-08 15:54:17'),
(47, '太棒了', 'dsfsf', NULL, '2022-06-29', '2022-07-01', 7777, 32213, 'ddf', 'fdsf', '2022-06-07 13:56:16', '2022-06-07 13:58:46'),
(48, '煩死了', 'fdsffs', NULL, '2022-06-16', '2022-06-25', 213, 342, 'dfdsfsd', 'fdsfsf', '2022-06-07 16:47:50', '2022-06-07 16:49:21'),
(49, '修改中', '修改中', NULL, '2022-05-12', '2022-06-01', 2312, 23131, '3123', '3123', '2022-06-07 17:19:45', '2022-06-07 17:28:14'),
(50, '更新中', '課程內容', NULL, '2022-06-14', '2022-07-14', 100, 4000, '老師', '位置', '2022-06-08 11:07:51', '2022-06-08 11:56:55'),
(51, '跳起來', '312312', NULL, '2022-06-06', '2022-06-23', 22, 0, '1233', '3123', '2022-06-08 11:37:06', '2022-06-08 14:13:50'),
(52, '在哪在哪裡', 'fdsfsdf', NULL, '2022-06-10', '2022-06-30', 123, 21312312, 'fdsfdsf', 'dfsd', '2022-06-08 11:38:30', '2022-06-08 16:17:51'),
(53, '新增', '太棒了', NULL, '2022-06-13', '2022-06-24', 213, 23123, '老師\'', '這裡', '2022-06-08 16:09:54', '2022-06-08 16:34:23'),
(54, 'dsda', 'fdsf', NULL, '2022-06-24', '2022-07-26', 3, 432, 'dfdsf', 'fdsfs', '2022-06-08 16:33:43', '2022-06-08 16:34:14'),
(55, 'yayayaya', 'cxvdvdsv', NULL, '2022-06-19', '2022-06-29', 3213, 231231, 'dscfdsf', 'fdsfds', '2022-06-08 16:36:23', '2022-06-08 16:36:23');

--
-- 已傾印資料表的索引
--

--
-- 資料表索引 `lesson`
--
ALTER TABLE `lesson`
  ADD PRIMARY KEY (`sid`);

--
-- 在傾印的資料表使用自動遞增(AUTO_INCREMENT)
--

--
-- 使用資料表自動遞增(AUTO_INCREMENT) `lesson`
--
ALTER TABLE `lesson`
  MODIFY `sid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=57;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
